; domain
(define (domain BLOCKS)
  (:requirements :strips)
  (:predicates (on ?x ?y)
	       (ontable ?x)
	       (clear ?x)
	       (handempty)
	       (holding ?x)
           (INROOM ?ROOM ?x)
	       )

  (:action pick-up
	     :parameters (?x)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x ?y)
	     :precondition (and (holding ?x) (clear ?y))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x ?y)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y))))


  (:action moveRoom
        :parameters (?x ?src ?des)
        :precondition (and(holding ?x) (INROOM ?src ?x))
        :effect (INROOM ?des ?x
        )
  ))

; problem
(define (problem BLOCKS-10-0)
(:domain BLOCKS)
(:objects A B C D E F ROOMA ROOMB)
(:INIT (CLEAR A) (CLEAR F) (ONTABLE B) (ONTABLE D) (ONTABLE C) (CLEAR D) (CLEAR C) (ONTABLE E) (ON F E) (ON A B) (INROOM ROOMA A) 
(INROOM ROOMA B) (INROOM ROOMA C) (INROOM ROOMB D)
(INROOM ROOMB E) (INROOM ROOMB F) (HANDEMPTY))
(:goal ( AND(INROOM ROOMA D) (INROOM ROOMA E) (INROOM ROOMA F) (INROOM ROOMB A) (INROOM ROOMB B)
(INROOM ROOMB C) (ON E F)  (ON D E)  (ON B C) (ON A B) )
))

; plan
1. (pick-up c)
   deleted: (ontable c) (clear c) (handempty)
   added: (holding c)
   goals met: 1 of 10
2. (moveroom c rooma roomb)
   added: (inroom roomb c)
   goals met: 2 of 10
3. (put-down c)
   deleted: (holding c)
   added: (clear c) (handempty) (ontable c)
   goals met: 2 of 10
4. (pick-up d)
   deleted: (ontable d) (clear d) (handempty)
   added: (holding d)
   goals met: 2 of 10
5. (moveroom d roomb rooma)
   added: (inroom rooma d)
   goals met: 3 of 10
6. (put-down d)
   deleted: (holding d)
   added: (clear d) (handempty) (ontable d)
   goals met: 3 of 10
7. (unstack a b)
   deleted: (clear a) (handempty) (on a b)
   added: (holding a) (clear b)
   goals met: 2 of 10
8. (moveroom a rooma roomb)
   added: (inroom roomb a)
   goals met: 3 of 10
9. (put-down a)
   deleted: (holding a)
   added: (clear a) (handempty) (ontable a)
   goals met: 3 of 10
10. (unstack f e)
   deleted: (clear f) (handempty) (on f e)
   added: (holding f) (clear e)
   goals met: 3 of 10
11. (moveroom f roomb rooma)
   added: (inroom rooma f)
   goals met: 4 of 10
12. (put-down f)
   deleted: (holding f)
   added: (clear f) (handempty) (ontable f)
   goals met: 4 of 10
13. (pick-up e)
   deleted: (ontable e) (clear e) (handempty)
   added: (holding e)
   goals met: 4 of 10
14. (moveroom e roomb rooma)
   added: (inroom rooma e)
   goals met: 5 of 10
15. (stack e f)
   deleted: (holding e) (clear f)
   added: (clear e) (handempty) (on e f)
   goals met: 6 of 10
16. (pick-up d)
   deleted: (ontable d) (clear d) (handempty)
   added: (holding d)
   goals met: 6 of 10
17. (stack d e)
   deleted: (holding d) (clear e)
   added: (clear d) (handempty) (on d e)
   goals met: 7 of 10
18. (pick-up b)
   deleted: (ontable b) (clear b) (handempty)
   added: (holding b)
   goals met: 7 of 10
19. (moveroom b rooma roomb)
   added: (inroom roomb b)
   goals met: 8 of 10
20. (stack b c)
   deleted: (holding b) (clear c)
   added: (clear b) (handempty) (on b c)
   goals met: 9 of 10
21. (pick-up a)
   deleted: (ontable a) (clear a) (handempty)
   added: (holding a)
   goals met: 9 of 10
22. (stack a b)
   deleted: (holding a) (clear b)
   added: (clear a) (handempty) (on a b)
   goals met: 10 of 10
